print("Шляпка гриба, покрытая _ кожиц..й, держится на _ ножк.. . Снизу шляпка затянута _ плёнкой. Когда ее уберешь, откроется нижняя _ сторона шляпк.. .")
a = input("Вставьте пропущенное слово: ") # темно-коричневой
b = input("Вставьте пропущенную букву: ") # е
c = input("Вставьте пропущенное слово: ") # крепкой
d = input("Вставьте пропущенную букву: ") # е
e = input("Вставьте пропущенное слово: ") # белой
f = input("Вставьте пропущенное слово: ") # желтоватая
g = input("Вставьте пропущенную букву: ") # и

print("Шляпка гриба, покрытая", a, "кожиц", b, "й", "держится на",c,"ножк",d, ".", "Снизу шляпка затянута",e, "пленкой. Когда ее уберешь, откроется нижняя",f,"сторона шляпк", g)